tap "buo/cask-upgrade"
tap "federico-terzi/espanso"
tap "homebrew/bundle"
tap "homebrew/cask", "https://mirrors.ustc.edu.cn/homebrew-cask.git"
tap "homebrew/cask-drivers", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask-drivers.git"
tap "homebrew/cask-fonts", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask-fonts.git"
tap "homebrew/cask-versions", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask-versions.git"
tap "homebrew/core", "https://github.com/Homebrew/homebrew-core.git"
tap "homebrew/services"
tap "koekeishiya/formulae"
brew "readline"
brew "aria2"
brew "gcc"
brew "libevent"
brew "atool"
brew "autojump"
brew "bat"
brew "python@3.9"
brew "glib"
brew "ccat"
brew "jansson"
brew "clamav"
brew "curl"
brew "emacs"
brew "exa"
brew "jasper"
brew "figlet"
brew "fzf"
brew "git"
brew "lua"
brew "go"
brew "handbrake"
brew "node"
brew "hexo"
brew "hugo"
brew "imagemagick"
brew "ipython", link: false
brew "lastpass-cli"
brew "lazygit"
brew "libconfig"
brew "libgcrypt"
brew "libressl"
brew "mackup"
brew "make"
brew "mas"
brew "mysql"
brew "neofetch"
brew "neovim"
brew "nvm"
brew "octave"
brew "openssh"
brew "p7zip"
brew "pandoc"
brew "ranger"
brew "redis"
brew "rust"
brew "sbcl"
brew "subversion"
brew "syncthing", restart_service: true
brew "texlive"
brew "the_silver_searcher"
brew "tmux"
brew "translate-shell"
brew "tree"
brew "vcpkg"
brew "w3m"
brew "wireguard-tools"
brew "zoxide"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "federico-terzi/espanso/espanso"
cask "aldente"
cask "amethyst"
cask "apparency"
cask "betterzip"
cask "bob"
cask "brave-browser"
cask "calibre"
cask "clashx-pro"
cask "clean-me"
cask "cryptomator"
cask "darktable"
cask "deepl"
cask "docker"
cask "electerm"
cask "firefox"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fontawesome"
cask "font-hack-nerd-font"
cask "free-download-manager"
cask "goldendict"
cask "google-backup-and-sync"
cask "google-chrome"
cask "google-earth-pro"
cask "gpg-suite-no-mail"
cask "hammerspoon"
cask "hiddenbar"
cask "hyper"
cask "iina"
cask "imageoptim"
cask "inkscape"
cask "iterm2"
cask "joplin"
cask "karabiner-elements"
cask "keepassxc"
cask "keeweb"
cask "keka"
cask "keybase"
cask "keycastr"
cask "keymanager"
cask "kitty"
cask "koodo-reader"
cask "latexit"
cask "lulu"
cask "macvim"
cask "maczip"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "motrix"
cask "neteasemusic"
cask "netnewswire"
cask "obs"
cask "obsidian"
cask "omnidisksweeper"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklook-json"
cask "quicklookase"
cask "r"
cask "raycast"
cask "secretive"
cask "skim"
cask "spotify"
cask "stats"
cask "sublime-text"
cask "suspicious-package"
cask "telegram-desktop"
cask "tencent-meeting"
cask "toggl-track"
cask "typora"
cask "ubersicht"
cask "upic"
cask "virtualbox"
cask "visual-studio-code"
cask "webpquicklook"
cask "zotero"
mas "Agenda", id: 1287445660
mas "CAJ云阅读", id: 1121965993
mas "CHM Viewer Star", id: 650683226
mas "Cubox", id: 1113361350
mas "FE File Explorer", id: 1444382558
mas "Grammarly for Safari", id: 1462114288
mas "Home Assistant", id: 1099568401
mas "iMovie 剪辑", id: 408981434
mas "Insomniac", id: 1434172648
mas "iShot", id: 1485844094
mas "KeeWeb Connect", id: 1565748094
mas "Keynote 讲演", id: 409183694
mas "MarginNote 3", id: 1423522373
mas "Mathpix Snipping Tool", id: 1349670778
mas "Numbers 表格", id: 409203825
mas "Octotree", id: 1457450145
mas "OneDrive", id: 823766827
mas "Pages 文稿", id: 409201541
mas "QQ", id: 451108668
mas "Rayon", id: 1609781496
mas "Save to Pocket", id: 1477385213
mas "Tab Space", id: 1473726602
mas "Table Tool", id: 1122008420
mas "Tampermonkey", id: 1482490089
mas "Tencent Lemon Lite", id: 1449962996
mas "Termius", id: 1176074088
mas "Vimari", id: 1480933944
mas "WidsMob Denoise", id: 1393718073
mas "万得股票", id: 1271308896
mas "同花顺", id: 1247341465
mas "微信", id: 836500024
mas "每日英语听力", id: 734383760
mas "网易邮箱大师", id: 1233593954
mas "腾讯视频", id: 1231336508
mas "谜底时钟", id: 1536358464
mas "超级右键", id: 1497428978
