tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask", "https://mirrors.ustc.edu.cn/homebrew-cask.git"
tap "homebrew/cask-drivers", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask-drivers.git"
tap "homebrew/cask-fonts", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask-fonts.git"
tap "homebrew/cask-versions", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask-versions.git"
tap "homebrew/core", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-core.git"
tap "homebrew/services"
brew "openssl@1.1"
brew "atool"
brew "readline"
brew "python@3.9"
brew "autojump"
brew "ccat"
brew "jansson"
brew "clamav"
brew "figlet"
brew "fzf"
brew "gh"
brew "git"
brew "glib"
brew "libevent"
brew "go"
brew "lua"
brew "imagemagick"
brew "ipython", link: false
brew "lastpass-cli"
brew "lazygit"
brew "libconfig"
brew "libgcrypt"
brew "mackup"
brew "make"
brew "mas"
brew "mysql"
brew "neofetch"
brew "neovim"
brew "p7zip"
brew "pandoc"
brew "ranger"
brew "rust"
brew "subversion"
brew "the_silver_searcher"
brew "tmux"
brew "translate-shell"
brew "v2ray"
brew "w3m"
brew "zsh"
brew "zsh-syntax-highlighting"
cask "basictex"
cask "betterzip"
cask "bob"
cask "brave-browser"
cask "clashx"
cask "deepl"
cask "firefox"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "free-download-manager"
cask "goldendict"
cask "google-earth-pro"
cask "hammerspoon"
cask "iina"
cask "imageoptim"
cask "iterm2"
cask "joplin"
cask "karabiner-elements"
cask "keka"
cask "latexit"
cask "macvim"
cask "maczip"
cask "netnewswire"
cask "notion"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklook-json"
cask "quicklookase"
cask "r"
cask "skim"
cask "spotify"
cask "suspicious-package"
cask "telegram-desktop"
cask "texshop"
cask "typora"
cask "visual-studio-code"
cask "webpquicklook"
mas "Adblock Plus", id: 1432731683
mas "AdGuard for Safari", id: 1440147259
mas "Agenda", id: 1287445660
mas "Atom Run", id: 850435736
mas "BBEdit", id: 404009241
mas "CAJ云阅读", id: 1121965993
mas "CHM Viewer Star", id: 650683226
mas "DuckDuckGo Privacy Essentials", id: 1482920575
mas "Encrypto", id: 935235287
mas "FE File Explorer", id: 1444382558
mas "Grammarly for Safari", id: 1462114288
mas "iMovie 剪辑", id: 408981434
mas "Input Source Pro", id: 1537056428
mas "Insomniac", id: 1434172648
mas "iShot", id: 1485844094
mas "Keynote 讲演", id: 409183694
mas "LastPass", id: 926036361
mas "Mathpix Snipping Tool", id: 1349670778
mas "Microsoft To Do", id: 1274495053
mas "Numbers 表格", id: 409203825
mas "OneDrive", id: 823766827
mas "Pages 文稿", id: 409201541
mas "PanText", id: 1551183766
mas "QQ", id: 451108668
mas "Tab Space", id: 1473726602
mas "Table Tool", id: 1122008420
mas "Tampermonkey", id: 1482490089
mas "Vimari", id: 1480933944
mas "WidsMob Denoise", id: 1393718073
mas "万得股票", id: 1271308896
mas "同花顺", id: 1247341465
mas "微信", id: 836500024
mas "每日英语听力", id: 734383760
mas "爱奇艺", id: 1012296988
mas "网易邮箱大师", id: 1233593954
mas "腾讯视频", id: 1231336508
mas "超级右键", id: 1497428978
