tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask", "https://mirrors.ustc.edu.cn/homebrew-cask.git"
tap "homebrew/cask-drivers", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask-drivers.git"
tap "homebrew/cask-fonts", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask-fonts.git"
tap "homebrew/cask-versions", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask-versions.git"
tap "homebrew/core", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-core.git"
tap "homebrew/services"
tap "koekeishiya/formulae"
brew "gcc"
brew "libevent"
brew "atool"
brew "readline"
brew "python@3.9"
brew "autojump"
brew "glib"
brew "ccat"
brew "jansson"
brew "clamav"
brew "curl"
brew "emacs"
brew "jasper"
brew "figlet"
brew "fzf"
brew "git"
brew "lua"
brew "go"
brew "handbrake"
brew "imagemagick"
brew "ipython", link: false
brew "lastpass-cli"
brew "lazygit"
brew "libconfig"
brew "libgcrypt"
brew "libressl"
brew "mackup"
brew "make"
brew "mas"
brew "mysql"
brew "neofetch"
brew "neovim"
brew "node"
brew "nvm"
brew "octave"
brew "openssh"
brew "p7zip"
brew "pandoc"
brew "ranger"
brew "redis"
brew "rust"
brew "sbcl"
brew "subversion"
brew "swift"
brew "syncthing", restart_service: true
brew "the_silver_searcher"
brew "tmux"
brew "translate-shell"
brew "tree"
brew "vcpkg"
brew "w3m"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
cask "aldente"
cask "apparency"
cask "basictex"
cask "betterzip"
cask "bob"
cask "brave-browser"
cask "calibre"
cask "clashx"
cask "deepl"
cask "docker"
cask "firefox"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "free-download-manager"
cask "goldendict"
cask "google-backup-and-sync"
cask "google-earth-pro"
cask "hammerspoon"
cask "hiddenbar"
cask "iina"
cask "imageoptim"
cask "iterm2"
cask "joplin"
cask "karabiner-elements"
cask "keka"
cask "keycastr"
cask "kitty"
cask "latexit"
cask "lulu"
cask "macvim"
cask "maczip"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "netnewswire"
cask "omnidisksweeper"
cask "picgo"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklook-json"
cask "quicklookase"
cask "r"
cask "raycast"
cask "skim"
cask "stats"
cask "steam"
cask "sublime-text"
cask "suspicious-package"
cask "telegram-desktop"
cask "typora"
cask "ubersicht"
cask "visual-studio-code"
cask "webpquicklook"
mas "Adblock Plus", id: 1432731683
mas "AdGuard for Safari", id: 1440147259
mas "Agenda", id: 1287445660
mas "BBEdit", id: 404009241
mas "CAJ云阅读", id: 1121965993
mas "CHM Viewer Star", id: 650683226
mas "DuckDuckGo Privacy Essentials", id: 1482920575
mas "Edison Mail", id: 1489591003
mas "FE File Explorer", id: 1444382558
mas "Grammarly for Safari", id: 1462114288
mas "iMovie", id: 408981434
mas "Insomniac", id: 1434172648
mas "iRightMouse", id: 1497428978
mas "iShot", id: 1485844094
mas "Keynote", id: 409183694
mas "LastPass", id: 926036361
mas "MarginNote 3", id: 1423522373
mas "Mathpix Snipping Tool", id: 1349670778
mas "MD Clock", id: 1536358464
mas "Night Eye", id: 1450504903
mas "Numbers", id: 409203825
mas "Octotree", id: 1457450145
mas "Pages", id: 409201541
mas "QQ", id: 451108668
mas "Tab Space", id: 1473726602
mas "Table Tool", id: 1122008420
mas "Tampermonkey", id: 1482490089
mas "Termius", id: 1176074088
mas "Vimari", id: 1480933944
mas "WeChat", id: 836500024
mas "WidsMob Denoise", id: 1393718073
mas "Wind Stock", id: 1271308896
mas "同花顺", id: 1247341465
mas "每日英语听力", id: 734383760
mas "网易邮箱大师", id: 1233593954
mas "腾讯视频", id: 1231336508
